//-------------------------------------------------------------
//【文件名】LinearFunction.cpp
//【功能模块和目的】Linear激活函数实现
//【开发者及日期】林钲凯 2025-07-27
//【更改记录】
//-------------------------------------------------------------

#include "LinearFunction.hpp"

using namespace std;

//-------------------------------------------------------------
//【函数名称】activate
//【函数功能】Linear 激活函数实现
//【参数】x：输入值
//【返回值】double，激活后输出
//【开发者及日期】林钲凯 2025-07-27
//【更改记录】
//-------------------------------------------------------------
double LinearFunction::activate(double x) const {
    return x;
}

//-------------------------------------------------------------
//【函数名称】getName
//【函数功能】获取函数名称
//【参数】无
//【返回值】string，函数名
//【开发者及日期】林钲凯 2025-07-27
//【更改记录】
//-------------------------------------------------------------
string LinearFunction::getName() const {
    return "Linear";
}

//-------------------------------------------------------------
//【函数名称】clone
//【函数功能】克隆自身
//【参数】无
//【返回值】unique_ptr<ActivationFunction>
//【开发者及日期】林钲凯 2025-07-27
//【更改记录】
//-------------------------------------------------------------
unique_ptr<ActivationFunction> LinearFunction::clone() const {
    return unique_ptr<ActivationFunction>(new LinearFunction());
}
